# -*- coding: utf-8 -*-
from bs4 import BeautifulSoup
import requests
import telebot
import datetime
import sqlite3
import os

VERSION = '7.4'
YEAR = '2017'
BASE_DIR = os.path.dirname(os.path.abspath(__file__))

#  __________________________________________________ROZKLAD__________________________________________________________


def get_rozklad(faculty='', teacher='', group='', sdate='', edate=''):

    zdu_dekanat_url = 'https://dekanat.zu.edu.ua/cgi-bin/timetable.cgi'
    med_url = 'http://46.219.3.50:8080/cgi-bin/timetable.cgi?n=700'
    med_groups = ['302сс/бак\n', ]

    http_headers = {
            'User-Agent': 'ZDU_Dekanat_Bot',
            'Accept': 'text/html',
    }

    try:
        post_data = {
            'faculty': faculty,
            'teacher': teacher.encode('windows-1251'),
            'group': group.encode('windows-1251'),
            'sdate': sdate,
            'edate': edate,
            'n': 700,
        }
    except Exception as ex:

        log(m='Помилка в роботі із словником post_data - {}\n'.format(str(ex)))
        return False

    try:

        if group in med_groups:
            page = requests.post(med_url, post_data, headers=http_headers)
        else:
            page = requests.post(zdu_dekanat_url, post_data, headers=http_headers, timeout=5)
    except Exception as ex:

        log(m='Помилка з підключенням - {}\n'.format(str(ex)))
        return False

    parsed_page = BeautifulSoup(page.content, 'html.parser')
    all_days_list = parsed_page.find_all('div', class_='col-md-6')[1:]
    all_days_lessons = []

    for day_table in all_days_list:
        all_days_lessons.append({
            'day': day_table.find('h4').find('small').text,
            'date': day_table.find('h4').text[:10],
            'lessons': [' '.join(lesson.text.split()) for lesson in day_table.find_all('td')[1::2]]
        })

    return all_days_lessons

#  ____________________________________________________BOT__________________________________________________________
connection = sqlite3.connect(os.path.join(BASE_DIR, 'users_db.sqlite'), check_same_thread=False)
TOKEN = '<TOKEN>'

bot = telebot.TeleBot(TOKEN)

keyboard = telebot.types.ReplyKeyboardMarkup(resize_keyboard=True, one_time_keyboard=True)
keyboard.row('\U0001F4D7 Сьогодні', '\U0001F4D8 Завтра', '\U0001F4DA На тижні')
keyboard.row('\U0001F464 По викладачу', '\U0001F570 Час пар', '\U0001F465 По групі')
keyboard.row('\U00002699 Зм. групу', '\U0001F308 Погода', '\U0001f4ac Довідка')

emoji_numbers = ['0⃣', '1⃣', '2⃣', '3⃣', '4⃣', '5⃣', '6⃣', '7⃣', '8⃣', '9⃣']

teachers = [
    'Франовський Анатолій Цезарович',
    'Халін Валерій Володимирович',
    'Шевчук Андрій Володимирович',
    'Яценко Світлана Леонідівна',
    'Вискушенко Андрій Петрович',
    'Журавльова Лариса Петрівна',
    'Кутек Тамара Борисівна',
    'Рожнова Тетяна Євгенівна',
    'Спірін Олег Михайлович',
    'Михайленко Василь Васильович',
    'Малежик Михайло Павлович',
    'Аннамухаммедов Азат Овезмухамедович',
    'Усатий Андрій В`ячеславович',
    'Башманівський Валерій Іванович',
    'Близнюк Андрій Сергійович',
    'Недашківська Тетяна Євгенівна',
    'Юрчук Олена Олександрівна',
    'Мосієнко Олена Володимирівна',
    'Стародубець Галина Миколаївна',
    'Кордон Микола Володимирович',
    'Ярмошик Іван Іванович',
    'Козловець Микола Адамович',
    'Семенюк Ірина Сергіївна',
    'Андрійчук Наталя Михайлівна',
    'Жуковська Вікторія Вікторівна',
    'Чирков Олександр Семенович',
    'Киричук Галина Євгеніївна',
    'Гарбар Олександр Васильович',
    'Стадниченко Агнеса Полікарпівна',
    'Томашик Василь Миколайович',
    'Поліщук Олена Петрівна',
    'Коновальчук Іван Іванович',
    'Плотницька Оксана Віталіївна',
    'Антонова Олена Євгеніївна',
    'Підгурська Валентина Юріївна',
    'Самойлюкевич Інна Володимирівна',
    'Саух Петро Юрійович',
    'Вікарчук Ольга Іванівна',
    'Дмитрієва Світлана Михайлівна',
    'Сейко Наталія Андріївна',
    'Корнійчук Наталія Миколаївна',
    'Ахметов Рустам Фагимович',
    'Грибан Григорій Петрович',
    'Яворська Тетяна Євгенівна',
    'Калініна Лариса Вадимівна',
    'Портницька Наталія Федорівна',
    'Батраченко Іван Георгійович',
    'Савиченко Ольга Михайлівна',
    'Весельська Алла Леонідівна',
    'Вишина Алла Юріївна',
    'Гавриловська Ксенія Петрівна',
    'Голентовська Ольга Святославівна',
    'Горбунова Вікторія Валеріївна',
    'Пирог Ганна Володимирівна',
    'Горностай Павло Петрович',
    'Гречуха Ірина Анатоліївна',
    'Кулаковська Ольга Григорівна',
    'Дем`янчук Юлія Юріївна',
    'Журавська Олена Вікторівна',
    'Заброцький Михайло Михайлович',
    'Загурська Інна Станіславівна',
    'Кирильчук Інна Василівна',
    'Кириченко Віктор Васильович',
    'Климчук Віталій Олександрович',
    'Коломієць Тетяна Володимирівна',
    'Котлова Людмила Олександрівна',
    'Кулаковський Тарас Юрійович',
    'Мазяр Олег Васильович',
    'Мойсієнко Ярослав Вікторович',
    'Никончук Наталія Олександрівна',
    'Степанюк Інна Андріївна',
    'Тичина Ірина Миколаївна',
    'Фальковська Людмила Миколаївна',
    'Хазратова Нігора Вікторівна',
    'Хоменко Наталія Василівна',
    'Шаран Ольга Сергіївна',
    'Шаюк Алла Василівна',
    'Шикирава Наталія Миколаївна',
    'Шапран Тетяна Миколаївна',
    'Ренькас Броніслава Мирославівна',
    'Шмиглюк Геннадій Аксентійович',
    'Шмиглюк Оксана Геннадіївна',
    'Чабанюк Наталія Іванівна',
    'Калініченко Олена Олександрівна',
    'Козюк Катерина Сергіївна',
    'Литвинчук Алла Іванівна',
    'Журавльов Валерій Пилипович',
    'Рудницький Сергій Владиславович',
    'Марчук Катерина Анатоліївна',
    'Рацілевич Андрій Петрович',
    'Саух Ірина Василівна',
    'Уразов Анатолій Устинович',
    'Скаковська Ольга Анатоліївна',
    'Горай Оксана Валентинівна',
    'Клімова Інна Олександрівна',
    'Зорницька Ірина Валеріївна',
    'Чумак Володимир Валентинович',
    'Венгерська Вікторія Олексіївна',
    'Вискушенко Дмитро Андрійович',
    'Жуковський Олександр Іванович',
    'Найфонов Давид Артурович',
    'Піддубна Оксана Михайлівна',
    'Чаплінська Оксана Вікторівна',
    'Миколишена Тетяна Вікторівна',
    'Анічкіна Олена Василівна',
    'Кусяк Наталія Володимирівна',
    'Камінський Олександр Миколайович',
    'Хоменко Тамара Іванівна',
    'Денисюк Роман Олександрович',
    'Листван Віталій Володимирович',
    'Листван Володимир Миколайович',
    'Янович Ірина Володимирівна',
    'Тітов Юрій Олександрович',
    'Євдоченко Олена Сергіївна',
    'Кондратенко Олена Ульянівна',
    'Романишина Людмила Михайлівна',
    'Кусяк Андрій Петрович',
    'Кичкирук Ольга Юріївна',
    'Уваєва Олена Іванівна',
    'Василенко Ольга Миколаївна',
    'Хом`як Іван Владиславович',
    'Онищук Ірина Петрівна',
    'Коцюба Ірина Юріївна',
    'Костюк Віталій Степанович',
    'Алпатова Оксана Миколаївна',
    'Кухарчук Алла Євгенівна',
    'Мостіпака Тетяна Петрівна',
    'Іщук Олена Миколаївна',
    'Перепелиця Людмила Олександрівна',
    'Муж Галина Василівна',
    'Астахова Лариса Євгенівна',
    'Першко Ірина Олександрівна',
    'Гарбар Діана Анатоліївна',
    'Шелюк Юлія Святославівна',
    'Луференко Ліна Юріївна',
    'Константиненко Людмила Анатоліївна',
    'Міхеєва Галина Миколаївна',
    'Пацюк Марина Костянтинівна',
    'Кутина Анастасія Олександрівна',
    'Швайко Ольга Дмитріївна',
    'Корево Ніна Іванівна',
    'Савенко Оксана Анатоліївна',
    'Акімов Ігор Андрійович',
    'Межжерін Сергій Віталійович',
    'Трускавецький Євген Степанович',
    'Янович Лариса Миколаївна',
    'Мельниченко Руслана Костянтинівна',
    'Єрмошина Тетяна Вікторівна',
    'Танська Валентина Володимирівна',
    'Павлюченко Олеся Вікторівна',
    'Власенко Руслана Петрівна',
    'Шевчук Світлана Юріївна',
    'Сорочинська Оксана Андріївна',
    'Сіваєва Катерина Володимирівна',
    'Гарлінська Алла Миколаївна',
    'Тарасова Юлія Вікторівна',
    'Васільєва Людмила Анатоліївна',
    'Весельський Микола Францович',
    'Буравський Олександр Антонович',
    'Кузьмін Олександр Сергійович',
    'Власюк Ігор Миколайович',
    'Міщук Галина Анатоліївна',
    'Гуцало Людмила Вікторівна',
    'Опанащук Петро Володимирович',
    'Седляр Анатолій Володимирович',
    'Хададова Марина Володимирівна',
    'Шандра Валентина Степанівна',
    'Новик Микола Кузьмович',
    'Падалко Анатолій Ілліч',
    'Рудницька Ольга Павлівна',
    'Магась-Демидас Юлія Іванівна',
    'Хоменко Олена Олександрівна',
    'Маркевич Оксана Валентинівна',
    'Зосімович Олена Юріївна',
    'Новик Валерій Анатолійович',
    'Шевчук Богдан Леонідович',
    'Викладачі СІД _',
    'Бабінська Марина Сергіївна',
    'Ковтуненко Ольга Іванівна',
    'Натикач Петро Іванович',
    'Рудницька Наталія Василівна',
    'Рафальська Тетяна Леонідівна',
    'Білобровець Ольга Матвіївна',
    'Ковальчук Іван Васильович',
    'Дребот Володимир Іванович',
    'Максимов Олександр Вікторович',
    'Новіцька Юлія Йосипівна',
    'Хитровська Юлія Валентинівна',
    'Сичевський Антон Олександрович',
    'Канівець Борис Андрійович',
    'Герасимчук Андрій Андрійович',
    'Бутковська Наталія Юріївна',
    'Стародубець Володимир Олексійович',
    'Сухачов Станіслав Якимович',
    'Вітюк Ірина Костянтинівна',
    'Горохова Людмила Вікторівна',
    'Гордійчук Ольга Олегівна',
    'Рускевич Анатолій Васильович',
    'Ковтун Наталія Михайлівна',
    'Слюсар Вадим Миколайович',
    'Заглада Віктор Миколайович',
    'Богачевська Ірина Вікторівна',
    'Борисенко Наталя Дмитрівна',
    'Вітвицька Світлана Сергіївна',
    'Березюк Олена Станіславівна',
    'Єремеєва Віра Модестівна',
    'Ковальчук Валентина Антонівна',
    'Сидорчук Нінель Герандівна',
    'Борейко Олександр Михайлович',
    'Власенко Ольга Миколаївна',
    'Мирончук Наталія Миколаївна',
    'Павленко Віта Віталіївна',
    'Агапов Юрій Юрійович',
    'Сбруєва Аліна Анатоліївна',
    'Круковська Ірина Миколаївна',
    'Копетчук Валентина Анатоліївна',
    'Новіцька Інеса Василівна',
    'Рудницька Неля Юрівна',
    'Вознюк Олександр Васильович',
    'Москвіна Тетяна Пилипівна',
    'Гужанова Тетяна Сергіївна',
    'Басюк Наталія Анатоліївна',
    'Федорова Марія Анатоліївна',
    'Максимова Олена Олександрівна',
    'Мурашевич Юлія Михайлівна',
    'Тарнавська Наталія Петрівна',
    'Коновальчук Інна Миколаївна',
    'Васянович Григорій Петрович',
    'Наумчук Тетяна Володимирівна',
    'Ковальчук Майя Олегівна',
    'Колесник Наталія Євгенівна',
    'Шмельова Тетяна Всеволодівна',
    'Ямчинська Галина Володимирівна',
    'Яцик Ірина Станіславівна',
    'Маловицька Людмила Флавіївна',
    'Коваль Тетяна Вікторівна',
    'Фурманюк Світлана Миколаївна',
    'Голубовська Ірина Владиславівна',
    'Гордієнко Олена Анатоліївна',
    'Левківська Олена Антонівна',
    'Марущак Олександра Миколаївна',
    'Підлужна Галина Володимирівна',
    'Усатий В`ячеслав Дмитрович',
    'Чупріна Олена Вадимівна',
    'Гуманкова Ольга Сергіївна',
    'Михайлова Оксана Сергіївна',
    'Карпенко Євгенія Миколаївна',
    'Литньова Ірина Федорівна',
    'Мазко Олена Петрівна',
    'Прохорова Світлана Миколаївна',
    'Зорницький Андрій Володимирович',
    'Мосейчук Олександр Михайлович',
    'Нідзельська Юлія Михайлівна',
    'Полховська Марина Володимирівна',
    'Топачевський Сергій Костянтинович',
    'Поліщук Людмила Петрівна',
    'Вискушенко Світлана Андріївна',
    'Асмукович Ірина Василівна',
    'Карпінський Юрій Владиславович',
    'Омецинська Ольга Володимирівна',
    'Пушкар Тетяна Миколаївна',
    'Марченко Євген Юрійович',
    'Буяльська Тетяна Іванівна',
    'Вотінова Дар`я Олексіївна',
    'Дем`янчук Ірина Владиславівна',
    'Кондратюк Ірина Борисівна',
    'Баладинська Ірина Владиславівна',
    'Бєлова Алла Дмитрівна',
    'Дем`янчук Олександр Никанорович',
    'Кияк Тарас Романович',
    'Олійник Світлана Василівна',
    'Фролова Ірина Євгеніївна',
    'Євченко Віра Володимирівна',
    'Соловйова Лариса Федорівна',
    'Моісєєва Маргарита Аркадіївна',
    'Рудик Ірина Миколаївна',
    'Савчук Інна Іванівна',
    'Андрушенко Олена Юріївна',
    'Щерба Наталія Сергіївна',
    'Бовсунівська Наталія Миколаївна',
    'Цюряк Ірина Олександрівна',
    'Папіжук Валентина Олександрівна',
    'Тарабріна Наталя Анатоліївна',
    'Кузьменко Олена Юріївна',
    'Сидорович Любов Євгенівна',
    'Черниш Оксана Андріївна',
    'Цюник Геннадій Михайлович',
    'Матушевська Наталія Володимирівна',
    'Доскач Катерина Василівна',
    'Буніятова Ізабелла Рафаїлівна',
    'Луценко Віктор Васильович',
    'Лісова Юлія Олександрівна',
    'Гузун Тетяна Іванівна',
    'Гузун Михайло Семенович',
    'Лозко Оксана Вікторівна',
    'Рутецький Василь Володимирович',
    'Татуревич Наталія Сергіївна',
    'Сичевська Валентина Василівна',
    'Комаренко Вероніка Василівна',
    'Плющик Єлизавета Василівна',
    'Неретін Валерій Олександрович',
    'Травкіна Наталія Михайлівна',
    'Федорченко Валентин Кузьмич',
    'Барало Людмила Володимирівна',
    'Новосадова Світлана Артемівна',
    'Суботницький Ігор Миколайович',
    'Роговська Єлизавета Владиславівна',
    'Демченко Ельвіра Азамжонівна',
    'Борисенко Наталія Сергіївна',
    'Котнюк Людмила Григорівна',
    'Чернишова Анна Михайлівна',
    'Онопрієнко Тетяна Миколаївна',
    'Тютюнник Ірина Федорівна',
    'Сніховська Ірена Едуардівна',
    'Даниленко Таісія Борисівна',
    'Малярчук Олена Валентинівна',
    'Остапчук Світлана Ігорівна',
    'Калінін Вадим Олександрович',
    'Григор`єва Тетяна Юріївна',
    'Войналович Людмила Петрівна',
    'Гаращук Кирил Володимирович',
    'Дячук Наталія Валеріївна',
    'Хорошун Ольга Олександрівна',
    'Примак Ольга Валеріїна',
    'Криворучко Тетяна Василівна',
    'Мартинова Ольга Миколаївна',
    'Чумак Людмила Миколаївна',
    'Білюк Інна Леонідівна',
    'Коломійчук Олександра Сергіївна',
    'Масель Юлія Сергіївна',
    'Малинівська Ольга Анатоліївна',
    'Мозговенко Оксана Ігорівна',
    'Євтушенко Анна Олегівна',
    'Горобченко Наталія Володимирівна',
    'Соколовська Світлана Францівна',
    'Ліпісівіцький Микола Леонідович',
    'Ковальова Тетяна Павлівна',
    'Борова Людмила Олексіївна',
    'Бараняк Марія Михайлівна',
    'Рудницька Наталія Миколаївна',
    'Анхим Олексій Іванович',
    'Максимчук Олена Леонідівна',
    'Долгополова Лілія Анатоліївна',
    'Баюн Крістіна Йосипівна',
    'Фант Микола Олександрович',
    'Федоренко Лариса Олександрівна',
    'Тараба Ірина Олександрівна',
    'Богайчук Інна Володимирівна',
    'Свириденко Ірина Миколаївна',
    'Фенчук Олена Олександрівна',
    'Мальченко Михайло Сергійович',
    'Король Євгенія Олександрівна',
    'Макаренко Наталія Вікторівна',
    'Сардак Олена Володимирівна',
    'Коляда Олег Васильович',
    'Закалюжний Леонід Володимирович',
    'Карплюк Світлана Олександрівна',
    'Кривонос Олександр Миколайович',
    'Горобець Сергій Миколайович',
    'Жуковський Сергій Станіславович',
    'Щехорський Анатолій Йосипович',
    'Михайленко Станіслав Васильович',
    'Вакалюк Тетяна Анатоліївна',
    'Федорчук Анна Леонідівна',
    'Усата Олена Юріївна',
    'Сікора Ярослава Богданівна',
    'Шимон Олександр Миколайович',
    'Яценко Оксана Іванівна',
    'Постова Світлана Анатоліївна',
    'Кривонос Мирослава Петрівна',
    'Мінгальова Юлія Ігорівна',
    'Загацька Наталія Олександрівна',
    'Головня Олена Сергіївна',
    'Сарана Олександр Анатолійович',
    'Таргонський Андрій Леонідович',
    'Осадчий Микола Мефодійович',
    'Подвисоцький Роман Володимирович',
    'Погоруй Анатолій Олександрович',
    'Севостьянов Євгеній Олександрович',
    'Григор`єва Інна Германівна',
    'Королюк Олена Миколаївна',
    'Дідківська Тетяна Вікторівна',
    'Сверчевська Ірина Анатоліївна',
    'Чемерис Ольга Анатоліївна',
    'Фонарюк Олена Василівна',
    'Ленчук Іван Григорович',
    'Міхеєв Віктор Васильович',
    'Федьович Микола Васильович',
    'Мосіюк Олександр Олександрович',
    'Поліщук Зоя Петрівна',
    'Прус Алла Володимирівна',
    'Ковальчук Олена Антонівна',
    'Орел Лілія Олександрівна',
    'Ткаченко Олександр Кирилович',
    'Зіновчук Андрій Васильович',
    'Степанчиков Дмитро Абрамович',
    'Нестеров Валерій Аркадійович',
    'Прокопенко Микола Миколайович',
    'Левківський Анатолій Миколайович',
    'Кіпаєва Тетяна Леонідівна',
    'Харченко Марія Миколаївна',
    'Новицький Сергій Вадимович',
    'Грищук Андрій Миколайович',
    'Грищук Віктор Валентинович',
    'Буханевич Наталія Віталіївна',
    'Васильєва Регіна Юхимівна',
    'Вербовський Ігор Андрійович',
    'Каленська Віталіна Петрівна',
    'Малинівська Людмила Іванівна',
    'Мелещенко Алла Анатоліївна',
    'Семенець Лариса Миколаївна',
    'Яценко Олександр Сергійович',
    'Вовченко Інна Іванівна',
    'Ляшко Юлія Станіславівна',
    'Тамашевський Іван Якович',
    'Левчук Леонід Іванович',
    'Лайчук Андрій Миколайович',
    'Мисечко Ольга Євгеніївна',
    'Кузнєцова Ганна Валеріївна',
    'Кузнєцова Ірина Володимирівна',
    'Кравець Олена Євгенівна',
    'Філіна Валентина Анатоліївна',
    'Шаверський Віктор Костянтинович',
    'Плахотнюк Наталія Павлівна',
    'Білошицька Тетяна Юріївна',
    'Біляк Ірина Валеріївна',
    'Большакова Надія Олександрівна',
    'Воробей Тамара Петрівна',
    'Гусаревич Олександр Валентинович',
    'Крук Алла Зенонівна',
    'Вольницька Дар`я Олегівна',
    'Хмара Вікторія Володимирівна',
    'Гарбуза Ірина Вікторівна',
    'Давидович Степан Сергійович',
    'Кафтанова Тетяна Віталіївна',
    'Дєнічева Ольга Ігорівна',
    'Саранча Микола Петрович',
    'Кухарьонок Світлана Степанівна',
    'Левківська Кристіна Валеріївна',
    'Лисецька Юлія Василівна',
    'Макаревич Олег Олександрович',
    'Маслюк Марина Ігорівна',
    'Мичка Іван В`ячеславович',
    'Мокіна Анна Геннадіївна',
    'Толкач Василь Павлович',
    'Очковська Анна Павлівна',
    'Сердійчук Лариса Петрівна',
    'Макарчук Людмила Петрівна',
    'Ямкова Ганна Іванівна',
    'Ляшевич Альона Михайлівна',
    'Грищук Сергій Миколайович',
    'Тименко Тамара Григорівна',
    'Дмитрієва Іванна Володимирівнв',
    'Яриновська Альона Анатоліївна',
    'Ващенко Тетяна Юріївна',
    'Чернуха Ірина Семенівна',
    'Радкевич Віта Володимирівна',
    'Ярош Валерія Валеріївна',
    'Гордійчук Світлана Вікторівна',
    'Крук Микола Зенонович',
    'Айунц Валентина Іванівна',
    'Блажиєвський Геннадій Валентинович',
    'Погребенник Людмила Іллівна',
    'Жуковська Маргарита Олексіївна',
    'Савитська Надія Олександрівна',
    'Трухан Леонід Васильович',
    'Твердохліб Жанна Олексіївна',
    'Яблонська Алла Миколаївна',
    'Осипенко Валерій Євгенійович',
    'Костюк Юлія Сергіївна',
    'Жуковський Євгеній Іванович',
    'Гончаренко Катерина Павлівна',
    'Довідна Марина Петрівна',
    'Василюк Ірина Миколаївна',
    'Місяць Наталія Купріянівна',
    'Макарова Ольга Юріївна',
    'Хмелінська Руслана Матвіївна',
    'Башманівський Олексій Леонідович',
    'Прищепа Олександр Васильович',
    'Вигівський Валерій Лук`янович',
    'Приймак Алла Миколаївна',
    'Волкова Олена Олександрівна',
    'Велика Аліна Михайлівна',
    'Самійлик Світлана Володимирівна',
    'Мельник Марина Володимирівна',
    'Білоус Петро Васильович',
    'Горбань Анфіса Василівна',
    'Чайковська Ванда Тадеушівна',
    'Франчук Марина Валеріївна',
    'Левченко Галина Дмитрівна',
    'Бондаренко Галина Федорівна',
    'Соболевська Галина Іванівна',
    'Астрахан Наталія Іванівна',
    'Рудюк Ольга Вікторівна',
    'Кацемба Юліана Леонідівна',
    'Талько Олена Борисівна',
    'Конторчук Ганна Кирилівна',
    'Доброльожа Галина Миронівна',
    'Гримашевич Галина Іванівна',
    'Дяченко Наталія Миколаївна',
    'Яценко Сергій Адамович',
    'Шарапа Марина Василівна',
    'Вольська Юлія Вікторівна',
    'Титаренко Валентина Миколаївна',
    'Ящук Леся Валеріївна',
    'Шевчук Тетяна Олександрівна',
    'Весельська Галина Станіславівна',
    'Пультер Станіслав Олександрович',
    'Білоус Ніна Миколаївна',
    'Лісовський Антон Михайлович',
    'Грибан Галина Василівна',
    'Кучерук Оксана Анатоліївна',
    'Шевцова Лариса Станіславівна',
    'Башманівська Любов Андріївна',
    'Маліновська Тетяна Володимирівна',
    'Пустохіна Вікторія Ігорівна',
    'Герасимчук Сніжана Вадимівна',
    'Дюжева Катерина Валеріївна',
    'Євченко Олександр Вікторович',
    'Клименко Тетяна Євгенівна',
    'Навальна Марина Іванівна',
    'Свінціцька Олена Іванівна',
    'Стадник Микола Миколайович',
    'Чернюк Сніжана Леонідівна',
    'Головецький Василь Миколайович',
    'Безверха Тетяна Миколаївна',
    'Василюк Валентина Іванівна',
    'Горбова Ірина Олексіївна',
    'Давидова Людмила Вікторівна',
    'Зайко Леся Яківна',
    'Зелінська Наталіна Миколаївна',
    'Масловська Марія Володимирівна',
    'Миколаєнко Надія Миколаївна',
    'Русецька Олена Борисівна',
    'Станкеєва Ірина Миколаївна',
    'Чорна Світлана Аркадіївна',
    'Денисевич Олена Вікторівна',
    'Павлінчук Тетяна Іванівна',
    'Максимець Світлана Миколаївна',
    'Фриз Ірина Володимирівна',
    'Стахова Ольга Олександрівна',
    'Ніколаєнко Сергій Миколайович',
    'Пойта Ірина Олександрівна',
    'Міщук Ірина Сергіївна',
    'Ніцак Ольга Борисівна',
    'Юрківська Людмила Йосипівна',
    'Боцян Тетяна Вікторівна',
    'Карпюк Ольга Анатоліївна',
    'Кащук Катерина Миколаївна',
    'Кіндрась Ольга Володимирівна',
    'Мартинов Сергій Вікторович',
    'Мосійчук Ірина Вікторівна',
    'Павловська Людмила Денисівна',
    'Юрківський Олександр Йосипович',
    'Філіпенко Тетяна Вячеславівна',
    'Янковська Ольга Іванівна',
    'Коляденко Світлана Миколаївна',
    'Ситняківська Світлана Михайлівна',
    'Павлик Надія Павлівна',
    'Ілліна Ольга Володимирівна',
    'Літяга Інна Володимирівна',
    'Товщик Сергій Андрійович',
    'Тарасенко Наталія Леонідівна',
    'Котловий Сергій Анатолійович',
    'Залібовська-Ільніцьк Зоя Володимирівна',
    'Палько Інна Миколаївна',
    'Бутузова Лариса Петрівна',
    'Король Лідія Миколаївна',
    'Мачушник Олена Леонідівна',
    'Сидоренко Наталія Іванівна',
    'Лісова Світлана Валеріївна',
    'Корінна Людмила Віталіївна',
    'Остапчук Олена Леонідівна',
    'Литвак Оксана Йосипівна',
    'Біляченко Галина Петрівна',
    'Безсмертна Вікторія Ігорівна',
    'Климова Катерина Яківна',
    'Дубравська Наталія Миколаївна',
    'Баргілевич Наталія Володимирівна',
    'Дудар Оксана Петрівна',
    'Клименко Дмитро Віталійович',
    'Чернобровкіна Віра Андріївна',
    'Мойсієнко Віктор Михайлович',
    'Недзельська Людмила Володимирівна',
    'Цибульський Василь Олександрович',
    'Коротун Наталя Григорівна',
    'Пилипко Олена Василівна',
    'Кхеліл Олеся Ігорівна',
    'Можарівська Ірина Олегівна',
    'Марчук Юлія Леонідівна',
    'Янчук Наталія Володимирівна',
    'Можаровська Тетяна Вікторівна',
    'Ількевич Наталія Сергіївна',
    'Корнійчук Платон Павлович',
    'Гирина Альона Асанівна',
    'Шугаєв Андрій Володимирович',
    'Ребрій Олександр Володимирович',
    'Литньова Тамара Вікторівна',
    'Шанскова Тетяна Ігорівна',
    'Бондар Аліна Миколаївна',
    'Юмашева Олександра Олександрівна',
    'Авдєєва Ольга Юріївна',
    'Бовсуновська Марина Олександрівна',
    'Фещук Володимир Васильович',
    'Шиманська Вікторія Василівна',
    'Мірошниченко Олена Анатоліївна',
    'Горбенко Галина Василівна',
    'Дунаєва Олена Ігорівна',
    'Чайка Микола Володимирович',
    'Білявська Вікторія Сергіївна',
    'Нікішова Тетяна Євгенівна',
    'Писаренко Сніжана Василівна',
    'Меленівська Людмила Іванівна',
    'Тищенко Михайло Станіславович',
    'Горик-Чубатюк Марина Олександрівна',
    'Трохимчук Ольга Володимирівна',
    'Ковальська Єва Юліанівна',
    'Світельська Олександра Володимирівна',
    'Луженецька Олена Петрівна',
    'Шинкарук Ірина Володимирівна',
    'Никончук Ірина Михайлівна',
    'Викладачі Історія України _',
    'Орищук Лілія Вікторівна',
    'Дунєва Олена І',
    'Арешонков Володимир Юрійович',
    'Бойчук Ірина Дмитрівна',
    'Андрійчук Тамара Вячеславівна',
    'Новосадова Наталія Григорівна',
    'Кот Юлія Сергіївна',
    'Савенко Оксана Петрівна',
    'Кадлубовська Наталія Станіславівна',
    'Захарченко Наталія Іванівна',
    'Фальківська Людмила Петрівна',
    'Музика Лідія Володимирівна',
    'Найдьонов Михайло Іванович',
    'Булгаков Олексій Ігорович',
    'Скалій Олександр Вячеславович',
    'Скалій Тетяна Валеріївна',
    'Набоков Юрій Анатолійович',
    'Левченко Ольга Миколаївна',
    'Дєньгаєва Світлана Вікторівна',
    'Прокопчук Наталія Романівна',
    'Сотська Галина Іванівна',
    'Огороднійчук Марія Володимирівна',
    'Моляко Валентин Олексійович',
    'Руда Іванна Василівна',
    'Горбачова Надія Ігорівна',
    'Щепанський Томаш __',
    'Кушева Жанна Іванівна',
    'Косигіна Олена Володимирівна',
    'Тимошенко Наталія Сергіївна',
    'Захарчук Вікторія Вікторівна',
    'Викладачі Всесвітня Історія',
    'Грицюта Наталія Миколаївна',
    'Бекетова Оксана Анатоліївна',
    'Мулярчук Інна Миколаївна',
    'Жуковець Аліна Миколаївна',
    'Толстова Ольга Вікторівна',
    'Васильєв Євгеній Михайлович',
    'Іщук Степан Іванович',
]


def log(chat=None, m=''):

    now_time = datetime.datetime.now().strftime('%d-%m %H:%M:%S')

    with open(os.path.join(BASE_DIR, 'bot_log.txt'), 'a') as log_file:
        if chat:
            log_file.write('[{}]: ({} {}) {}\n'.format(now_time, chat.first_name, chat.last_name, m))
        else:
            log_file.write('[{}]: (Server) {}\n'.format(now_time, m))

    if not chat:
        return

    try:
        cursor = connection.cursor()
        cursor.execute("""UPDATE users SET requests_count=requests_count+1, last_use_date=?, first_name=?, last_name=? 
        WHERE t_id=?""", (now_time, chat.first_name, chat.last_name, chat.id))
        connection.commit()
        cursor.close()

    except Exception as ex:
        log(m='Помилка при оновленні даних про користувача: ' + str(ex))


def create_database():

    cursor = connection.cursor()
    cursor.execute("""CREATE TABLE IF NOT EXISTS users(
                      t_id TEXT PRIMARY KEY NOT NULL,
                      username TEXT,
                      first_name TEXT,
                      last_name TEXT,
                      u_group TEXT,
                      register_date TEXT,
                      last_use_date TEXT,
                      requests_count INTEGER DEFAULT 0) WITHOUT ROWID""")
    connection.commit()
    cursor.close()


def get_user_group(user_id):

    try:
        cursor = connection.cursor()
        cursor.execute("""SELECT u_group FROM users WHERE t_id=?""", (user_id,))
        connection.commit()
        user_group = cursor.fetchone()
        cursor.close()
    except Exception as ex:
        connection.rollback()
        log(m='Помилка при отриманні групи - {}'.format(str(ex)))
        return False

    if not user_group:
        return False
    return user_group[0]


def add_or_update_user_to_db(chat, group):

    if not get_user_group(chat.id):

        now_time = datetime.datetime.now().strftime('%d-%m-%Y %H:%M:%S')
        try:
            cursor = connection.cursor()
            cursor.execute("INSERT INTO users (t_id, username, first_name, last_name, u_group, register_date) "
                           "VALUES (?, ?, ?, ?, ?, ?)",
                           (chat.id, chat.username, chat.first_name, chat.last_name, group, now_time))
            connection.commit()
            cursor.close()

            log(chat=chat, m='вказав свою групу - {}'.format(group))

        except Exception as ex:
            connection.rollback()
            log(m='Помилка при додаванні користувача - {}'.format(str(ex)))

    else:

        try:
            cursor = connection.cursor()
            cursor.execute("""UPDATE users SET u_group=? WHERE t_id=?""", (group, chat.id))
            connection.commit()
            cursor.close()
            log(chat=chat, m='змінив свою групу на - {}'.format(group))

        except Exception as ex:
            connection.rollback()
            log(m='Помилка при оновленні групи користувача - {}'.format(str(ex)))


def show_day_rozklad(day_data):

    rozklad = '.....::::: <b>\U0001F4CB {}</b> ({}) :::::.....\n\n'.format(day_data['day'], day_data['date'][:-5:])

    lessons = day_data['lessons']

    for i in range(8):
        if lessons[i]:
            s_index = i
            break

    for i in range(7, -1, -1):
        if lessons[i]:
            e_index = i
            break

    for i in range(s_index, e_index + 1):
        if lessons[i]:
            rozklad += '{} {}\n\n'.format(emoji_numbers[i + 1], lessons[i])
        else:
            rozklad += '{} Вікно \U0001F643\n\n'.format(emoji_numbers[i + 1])

    return rozklad


@bot.message_handler(commands=['start'])
def start(message):
    sent = bot.send_message(message.chat.id, 'Йоу, {} 😊. Я Бот який допоможе тобі швидко дізнаватись свій розклад прямо тут.'
                                             ' Для початку скажи мені свою групу (Напр. 44_і_д)'.format(message.chat.first_name))
    bot.register_next_step_handler(sent, set_group)


def set_group(message):

    if message.text == 'Відміна':
        user_group = get_user_group(message.chat.id)
        bot.send_message(message.chat.id, 'Добре, залишимо групу {}.'.format(user_group), reply_markup=keyboard)
        return

    if ' ' in message.text:
        bot.send_message(message.chat.id, 'Група вказується без пробілів. А точно так, як на сайті.',
                         reply_markup=keyboard)
        return

    add_or_update_user_to_db(message.chat, message.text)

    bot.send_message(message.chat.id, 'Чудово 👍, відтепер я буду показувати розклад для групи {}.'.
                     format(message.text), reply_markup=keyboard)


@bot.message_handler(regexp='^(\d{1,2})\.(\d{1,2})$')
def to_date(message):

    group = get_user_group(message.chat.id)

    if not group:
        bot.send_message(message.chat.id, 'Щоб вказати групу жми -> /start')
        return

    date = message.text + '.' + YEAR
    rozklad_data = get_rozklad(group=group, edate=date, sdate=date)

    log(chat=message.chat, m='Розклад по даті {}'.format(date))

    if rozklad_data:
        rozklad_for_date = show_day_rozklad(rozklad_data[0])
    else:
        msg = 'Щоб подивитися розклад на конкретний день, введи дату в одному із таких форматів:' \
              '\n<b>05.03</b>\n<b>27.03</b>\n<b>5.3</b>' \
              '\nДля відображення по кільком дням (рекомендується не більше 8 днів підряд):\n<b>20.03-22.03</b>\n' \
              '\n<i>Вводиться без пробілів (день.місяць)</i><b> рік вводити не треба</b> ' \
              '<i>Якщо розклад по кільком дням не працює - введіть меншу кількість днів.</i>'
        rozklad_for_date = 'На <b>{}</b>, для групи <b>{}</b> пар не знайдено.\n\n{}'.format(date, group, msg)

    bot.send_message(message.chat.id, rozklad_for_date, parse_mode='HTML', reply_markup=keyboard)


@bot.message_handler(regexp='^(\d{1,2})\.(\d{1,2})-(\d{1,2})\.(\d{1,2})$')
def from_date_to_date(message):

    group = get_user_group(message.chat.id)

    if not group:
        bot.send_message(message.chat.id, 'Щоб вказати групу жми -> /start')
        return

    _sdate = message.text.split('-')[0] + '.' + YEAR
    _edate = message.text.split('-')[1] + '.' + YEAR

    rozklad_data = get_rozklad(group=group, sdate=_sdate, edate=_edate)

    rozklad_for_days = ''

    log(chat=message.chat, m='Розклад по датах {}'.format(message.text))

    if rozklad_data:
        for rozklad_day in rozklad_data:
            rozklad_for_days += show_day_rozklad(rozklad_day)

    else:
        msg = 'Щоб подивитися розклад на конкретний день, введи дату в одному із таких форматів:' \
              '\n<b>05.03</b>\n<b>27.03</b>\n<b>5.3</b>' \
              '\nДля відображення по кільком дням (рекомендується не більше 8 днів підряд):\n<b>20.03-22.03</b>\n' \
              '\n<i>Вводиться без пробілів (день.місяць)</i><b> рік вводити не треба.</b> ' \
              '<i>Якщо розклад по кільком дням не працює - введіть меншу кількість днів.</i>'
        rozklad_for_days = 'На <b>{}-{}</b>, для групи <b>{}</b> пар не знайдено.\n\n{}'.format(_sdate, _edate,
                                                                                                group, msg)

    bot.send_message(message.chat.id, rozklad_for_days, parse_mode='HTML', reply_markup=keyboard)


def get_teachers_name(surname):

    rez = []

    for teacher in teachers:
        if teacher.split()[0].upper() == surname.upper():
            rez.append(teacher)

    return rez


def show_teachers(chat_id, name):

    in_week = datetime.date.today() + datetime.timedelta(days=7)

    in_week_day = in_week.strftime('%d.%m.%Y')
    today = datetime.date.today().strftime('%d.%m.%Y')

    rozklad_data = get_rozklad(teacher=name, sdate=today, edate=in_week_day)

    rozklad_for_week = ''

    if rozklad_data:
        rozklad_for_week = 'Розклад на тиждень у <b>{}</b>:\n\n'.format(name)
        for rozklad_day in rozklad_data:
            rozklad_for_week += show_day_rozklad(rozklad_day)
    else:
        rozklad_for_week = 'На тиждень пар у викладача <b>{}</b> не знайдено.'.format(name)

    bot.send_message(chat_id, rozklad_for_week, reply_markup=keyboard, parse_mode='HTML')


def select_teacher_from_request(message):  # ф-я викликається коли є 2 і більше викладачі з таким прізвищем

    if message.text == 'Назад':
        bot.send_message(message.chat.id, 'Окей)', reply_markup=keyboard)
        return

    show_teachers(message.chat.id, message.text)


def select_teachers(message):

    tchrs = get_teachers_name(message.text)

    if not tchrs:
        bot.send_message(message.chat.id, 'Не можу знайти викладача з таким прізвищем.',
                         reply_markup=keyboard)

    if len(tchrs) == 1:
        show_teachers(message.chat.id, tchrs[0])

    if len(tchrs) > 1:

        teachers_keyboard = telebot.types.ReplyKeyboardMarkup(resize_keyboard=True, one_time_keyboard=True)
        for teacher in tchrs:
            teachers_keyboard.row(teacher)

        teachers_keyboard.row('Назад')
        sent = bot.send_message(message.chat.id, 'Вибери викладача:', reply_markup=teachers_keyboard)
        bot.register_next_step_handler(sent, select_teacher_from_request)


@bot.message_handler(content_types=["text"])
def main_menu(message):

    if get_user_group(message.chat.id):

        log(message.chat, '> {}'.format(message.text))

        if message.text == '\U0001F4D7 Сьогодні':
            group = get_user_group(message.chat.id)
            rozklad_data = get_rozklad(group=group)

            if rozklad_data:
                rozklad_for_today = show_day_rozklad(rozklad_data[0])
            else:
                rozklad_for_today = "На сьогодні пар не знайдено."

            bot.send_message(message.chat.id, rozklad_for_today, parse_mode='HTML', reply_markup=keyboard)

        elif message.text == '\U0001F4D8 Завтра':

            tomorrow = datetime.date.today() + datetime.timedelta(days=1)
            tom_day = tomorrow.strftime('%d.%m.%Y')

            group = get_user_group(message.chat.id)
            rozklad_data = get_rozklad(group=group, sdate=tom_day, edate=tom_day)

            if rozklad_data:
                rozklad_for_tom = show_day_rozklad(rozklad_data[0])
            else:
                rozklad_for_tom = 'На завтра пар не знайдено.'

            bot.send_message(message.chat.id, rozklad_for_tom, parse_mode='HTML', reply_markup=keyboard)

        elif message.text == '\U0001F4DA На тижні':

            in_week = datetime.date.today() + datetime.timedelta(days=7)

            in_week_day = in_week.strftime('%d.%m.%Y')
            today = datetime.date.today().strftime('%d.%m.%Y')

            group = get_user_group(message.chat.id)
            rozklad_data = get_rozklad(group=group, sdate=today, edate=in_week_day)

            rozklad_for_week = ''

            if rozklad_data:
                for rozklad_day in rozklad_data:
                    rozklad_for_week += show_day_rozklad(rozklad_day)
            else:
                rozklad_for_week = 'На тиждень пар не знайдено.'

            if len(rozklad_for_week) < 4100:
                bot.send_message(message.chat.id, rozklad_for_week, parse_mode='HTML', reply_markup=keyboard)

            else:
                rozklad_for_week = ''

                for rozklad_day in rozklad_data[1:]:
                    rozklad_for_week += show_day_rozklad(rozklad_day)

                bot.send_message(message.chat.id, rozklad_for_week, parse_mode='HTML', reply_markup=keyboard)

        elif message.text == '\U0001F570 Час пар':
            lessons_time = "<b>Час пар:</b>\n" \
                           "{} 08:30-09:50\n{} 10:00-11:20\n" \
                           "{} 11:40-13:00\n{} 13:10-14:30\n" \
                           "{} 14:40-16:00\n{} 16:20-17:40 \n" \
                           "{} 17:50-19:10\n{} 19:20-20:40".format(emoji_numbers[1], emoji_numbers[2], emoji_numbers[3],
                                                                   emoji_numbers[4], emoji_numbers[5], emoji_numbers[6],
                                                                   emoji_numbers[7], emoji_numbers[8])

            bot.send_message(message.chat.id, lessons_time, parse_mode='HTML', reply_markup=keyboard)

        elif message.text == '\U00002699 Зм. групу':

            user_group = get_user_group(message.chat.id)

            cancel_kb = telebot.types.ReplyKeyboardMarkup(resize_keyboard=True, one_time_keyboard=True)
            cancel_kb.row('Відміна')

            msg = 'Твоя група: {}\nЩоб змінити введи нову групу'.format(user_group)

            sent = bot.send_message(message.chat.id, msg, parse_mode='HTML', reply_markup=cancel_kb)
            bot.register_next_step_handler(sent, set_group)

        elif message.text == '\U0001f4ac Довідка':

            try:
                forecast_update_date = os.path.getmtime(os.path.join(BASE_DIR, 'forecast.txt'))
                mod_time = datetime.datetime.fromtimestamp(forecast_update_date).strftime('%H:%M')

            except Exception:
                mod_time = '-'

            msg = "Для пошуку розкладу по конкретним датам вводь:\n " \
                  "<b> 15.05</b> - по дню\n <b> 15.05-22.05</b> - по кільком дням\n" \
                  "__________________________\n" \
                  "Якщо ти маєш пропозиції щодо покращення, повідомлення про помилки " \
                  "пиши сюди:\n <b>Телеграм:</b> @Koocherov \n <b>VK:</b> vk.com/koocherov\n" \
                  "__________________________\n<b>Версія:</b> {}\n<b>Оновлення погоди:</b> {}"

            bot.send_message(message.chat.id, msg.format(VERSION, mod_time), reply_markup=keyboard, parse_mode='HTML')

        elif message.text == '\U0001F465 По групі':
            sent = bot.send_message(message.chat.id,
                                    'Для того щоб подивитись розклад будь якої групи на тиждень введи її назву',
                                    reply_markup=keyboard)
            bot.register_next_step_handler(sent, show_other_group)

        elif message.text == '\U0001F4C5 По даті':

            msg = 'Щоб подивитися розклад на конкретний день, введи дату в одному із таких форматів:' \
                  '\n<b>05.03</b>\n<b>27.03</b>\n<b>5.3</b>' \
                  '\nДля відображення по кільком дням (рекомендується не більше 8 днів підряд):\n<b>20.03-22.03</b>\n' \
                  '\n<i>Вводиться без пробілів (день.місяць) </i><b>рік вводити не треба</b>. ' \
                  '<i>Якщо розклад по кільком дням не працює - введіть меншу кількість днів.</i>'

            bot.send_message(message.chat.id, msg, reply_markup=keyboard, parse_mode='HTML')

        elif message.text == '\U0001F308 Погода':

            try:
                with open(os.path.join(BASE_DIR, 'forecast.txt'), 'r') as forecast_file:
                    forecast = forecast_file.read()

                bot.send_message(message.chat.id, forecast, reply_markup=keyboard, parse_mode='HTML')
            except Exception:

                bot.send_message(message.chat.id, 'Погоду не завантажено.', reply_markup=keyboard, parse_mode='HTML')

        elif message.text == '\U0001F464 По викладачу':

            sent = bot.send_message(message.chat.id,
                                    'Для того щоб подивитись розклад викладача на поточний тиждень - '
                                    'введи його прізвище.',
                                    reply_markup=keyboard)
            bot.register_next_step_handler(sent, select_teachers)

        else:
            bot.send_message(message.chat.id, '\U0001F440')

    else:
        bot.send_message(message.chat.id, 'Щоб вказати групу жми -> /start')


def show_other_group(message):

    group = message.text

    if ' ' in group:
        bot.send_message(message.chat.id, 'В назві групи не може бути пробілів.',
                         reply_markup=keyboard)
        return

    in_week = datetime.date.today() + datetime.timedelta(days=7)
    in_week_day = in_week.strftime('%d.%m.%Y')

    today = datetime.date.today().strftime('%d.%m.%Y')

    rozklad_data = get_rozklad(group=group, sdate=today, edate=in_week_day)

    rozklad_for_week = '<b>Розклад на тиждень групи {}:</b>\n\n'.format(message.text)

    if rozklad_data:
        for rozklad_day in rozklad_data:
            rozklad_for_week += show_day_rozklad(rozklad_day)
    else:
        rozklad_for_week = 'На тиждень пар для групи {} не знайдено.'.format(group)

    if len(rozklad_for_week) < 4100:
        bot.send_message(message.chat.id, rozklad_for_week, parse_mode='HTML', reply_markup=keyboard)

    else:
        rozklad_for_week = ''

        for rozklad_day in rozklad_data[1:]:
            rozklad_for_week += show_day_rozklad(rozklad_day)

        bot.send_message(message.chat.id, rozklad_for_week, parse_mode='HTML', reply_markup=keyboard)


#  ____________________________________________________SERVER__________________________________________________________


if __name__ == '__main__':

    create_database()

    try:
        log(m='Запуск..')
        bot.polling(none_stop=True, interval=3)

    except Exception as ex:

        log(m='Помилка - {}\n'.format(str(ex)))
        bot.stop_polling()

        data = {
            'chat_id': 204560928,  # my ID
            'text': 'Шось навернулось.\nА саме: {}'.format(str(ex))
        }

        requests.get('https://api.telegram.org/bot{}/sendMessage'.format(TOKEN), params=data)